Repository: Mekhty111/Hesabino-
Catalog: Compositor/*.lproj/Localizable.strings
Languages: az, ru

# app_title
source: Domino Abacus
az: Domino üçün çot
ru: Счёты для домино

# app_subtitle
source: Use your phone like real abacus beads to keep score.
az: Xalı telefonla çot kimi istifadə et və xalları say.
ru: Используй телефон как настоящие счёты для подсчёта очков.

# points_title
source: Score
az: Xal
ru: Очки

source: Reset player
az: Oyunçunu sıfırla
ru: Сбросить игрока

source: Reset all
az: Hamısını sıfırla
ru: Сбросить всё

# mode_phone365_title
source: Phone (365)
az: Telefon (365)
ru: Телефон (365)

# mode_phone365_subtitle
source: Rows: ×5, ×10, ×100
az: Sıralar: ×5, ×10, ×100
ru: Ряды: ×5, ×10, ×100

# mode_101_subtitle
source: Rows: ×1, ×10, ×100
az: Sıralar: ×1, ×10, ×100
ru: Ряды: ×1, ×10, ×100

# settings_title
source: Settings
az: Ayarlar
ru: Настройки

# language_title
source: Language
az: Dil
ru: Язык

# language_ru
source: Russian
az: Русский
ru: Русский

# language_az
source: Azerbaijani
az: Azərbaycan
ru: Azərbaycan

source: Done
az: Hazır
ru: Готово

# player_n_format
source: Player %d
az: Oyunçu %d
ru: Игрок %d

source: Player 1
az: Oyunçu 1
ru: Игрок 1

source: Player 2
az: Oyunçu 2
ru: Игрок 2

source: Player 3
az: Oyunçu 3
ru: Игрок 3

source: Player 4
az: Oyunçu 4
ru: Игрок 4

source: Team 1
az: Komanda 1
ru: Команда 1

source: Team 2
az: Komanda 2
ru: Команда 2

# choose_mode_title
source: Choose game mode
az: Oyun rejimini seçin
ru: Выберите режим игры

# choose_mode_subtitle
source: How do you want to keep score?
az: Xalı necə sayaq?
ru: Как будем вести счёт?

# mode_pairs_button
source: Play in pairs (2 teams)
az: Cüt oynamaq (2 komanda)
ru: Играть в паре (2 команды)

# mode_freeforall_button
source: Everyone for themselves (4 players)
az: Hər kəs özü üçün (4 oyunçu)
ru: Каждый сам за себя (4 игрока)

# match_mode_title
source: Match mode
az: Matç rejimi
ru: Режим матча

# match_mode_pairs
source: Pairs (2 teams)
az: Cütlər (2 komanda)
ru: Пары (2 команды)

# match_mode_freeforall
source: Free-for-all (4 players)
az: Hər kəs özü üçün (4 oyunçu)
ru: Каждый сам за себя (4 игрока)

# score_display_mode_title
source: Score display
az: Xalın göstərilməsi
ru: Отображение счёта

# score_display_per_team
source: Separate
az: Ayrı-ayrı
ru: Отдельно

# score_display_shared
source: Shared board
az: Orta çot
ru: Общие счёты

# row_label_win_team_1
source: Wins 1
az: Qələbə 1
ru: Победы 1

# row_label_win_team_2
source: Wins 2
az: Qələbə 2
ru: Победы 2

# winner_label
source: Winner
az: Qalib
ru: Победитель

# total_wins_label
source: wins
az: qələbə
ru: победа

# session_detail_title
source: Session Details
az: Sessiyanın təfrrüdatı
ru: Детализация сессии

source: Session Winner
az: Sessiyanın qalibi
ru: Победитель сессии

# game_sessions_title
source: Games in Session
az: Sessiyadakı oyunlar
ru: Игры в сессии

# game_label
source: Game
az: Oyun
ru: Игра

# settings_subtitle
source: Customize your game experience
az: Oyun təcrübənizi fərdiləşdirin
ru: Настройте игру под себя

# abacus_style_title
source: Abacus Style
az: Sayğac Üslubu
ru: Стиль счетов

# abacus_style_classic
source: Classic
az: Klassik
ru: Классический

# abacus_style_classic_subtitle
source: Traditional wooden design
az: Ənənəvi taxta dizayn
ru: Традиционный деревянный дизайн

# abacus_style_stone
source: Stone
az: Daş
ru: Каменный

# abacus_style_stone_subtitle
source: Durable stone texture
az: Davamlı daş teksturası
ru: Прочная каменная текстура

# abacus_style_neon
source: Neon
ru: Неоновый

# abacus_style_neon_subtitle
source: Bright neon style
az: Parlaq neon üslubu
ru: Яркий неоновый стиль

# abacus_style_wooden
source: Wooden
az: Taxta
ru: Деревянный

# abacus_style_wooden_subtitle
source: Natural wood
az: Təbii ağac
ru: Натуральное дерево

# match_mode_pairs_subtitle
source: 2 teams compete
az: 2 komanda mübarizə aparır
ru: 2 команды соревнуются

# match_mode_freeforall_subtitle
source: 4 players play for themselves
az: 4 oyunçu özləri üçün oynayır
ru: 4 игрока играют каждый за себя

# score_display_per_team_subtitle
source: Separate scores for each team
az: Hər komanda üçün ayrı xallar
ru: Отдельные счеты для каждой команды

# score_display_shared_subtitle
source: Shared scores for teams
az: Komandalar üçün ortaq xallar
ru: Общие счеты для команд

# swipe_hint_to_101
source: Swipe left to switch to 101
az: 101 rejiminə keçmək üçün sola sürüşdür
ru: Свайпни влево, чтобы перейти к 101

# swipe_hint_to_365
source: Swipe right to switch to 365
az: 365 rejiminə keçmək üçün sağa sürüşdür
ru: Свайпни вправо, чтобы перейти к 365

# history_title
source: Game history
az: Oyun tarixçəsi
ru: История игр

# history_empty
source: Your history is empty. Finished games will appear here.
az: Hələ tarixçə boşdur. Bitmiş oyunlar burada görünəcək.
ru: История пока пуста. Завершённые игры будут появляться здесь.

# end_game_title
source: End the game?
az: Oyunu bitirək?
ru: Завершить игру?

# end_game_subtitle
source: Current score will be saved to history and a new round will start.
az: Cari xal tarixçəyə yazılacaq və yeni oyun başlanacaq.
ru: Текущий счёт будет сохранён в историю и начнётся новая партия.

# end_game_cancel
source: No, by mistake
az: Yox, səhv oldu
ru: Нет, случайно

# end_game_confirm
source: End game
az: Oyunu bitir
ru: Завершить игру

# history_delete
source: Delete
az: Sil
ru: Удалить

source: Rename team
az: Komandanı adlandır
ru: Переименовать команду

# rename_team_title
source: Team name
az: Komandanın adı
ru: Название команды

# rename_team_subtitle
source: Set your own names for both teams.
az: Hər iki komanda üçün öz adlarını təyin et.
ru: Задайте свои названия для обеих команд.

# rename_team_placeholder
source: Enter name
az: Adı daxil et
ru: Введите название

# rename_team_cancel
source: Cancel
az: Ləğv et
ru: Отмена

# rename_team_save
source: Save
az: Yadda saxla
ru: Сохранить

# onboarding_page1_title
source: Digital abacus for domino
az: Domino üçün rəqəmsal çot
ru: Цифровые счёты для домино

# onboarding_page1_subtitle
source: Keep score like on real abacus: clear, shared for everyone, and without mistakes.
az: Həqiqi çot kimi xal apar: rahat, hamıya görünən və səhvsiz.
ru: Веди счёт партии как на настоящих счётах: удобно, видно всем и без ошибок.

# onboarding_page2_title
source: Choose how you count
az: Hansı rejimlə sayaq?
ru: Выбери режим подсчёта

# onboarding_page2_subtitle
source: Phone (365) or 101, pairs or free‑for‑all, separate or shared board for teams — all in one place.
az: Telefon (365) və ya 101, cütlər və ya hər kəs özü üçün, komandalar üçün ayrı və ya ümumi çot — hamısı bir ekranda.
ru: Телефон (365) или 101, пары или каждый сам за себя, отдельные или общие счёты для команд — всё на одном экране.

# onboarding_page3_title
source: Swipe and shake
az: Sürüşdür və silkələ
ru: Свайп и встряхивание

# onboarding_page3_subtitle
source: Swipe the abacus left/right to switch modes (365 ↔ 101). Give the phone a strong shake to reset all points.
az: Çotu sola/sağa sürüşdürərək rejimləri dəyiş (365 ↔ 101). Telefonu güclü silkələ ki, bütün xallar sıfırlansın.
ru: Свайпай счёты влево/вправо, чтобы переключать режим (365 ↔ 101). Сильно встряхни телефон, чтобы обнулить все очки.

# onboarding_button_next
source: Next
az: Davam
ru: Далее

# onboarding_button_start
source: Start using
az: Başla
ru: Начать пользоваться

# onboarding_button_skip
source: Skip
az: Keçmək
ru: Пропустить
